
//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ДанныеПоЗакрывающимДокументамСуммаПриИзменении(Элемент)
	
	Объект.ИтоговаяСуммаПоМероприятию =Объект.ДанныеПоЗакрывающимДокументам.Итог("Сумма");
	
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ДанныеПоЗакрывающимДокументамПередУдалением(Элемент, Отказ)  
	Объект.ИтоговаяСуммаПоМероприятию =Объект.ДанныеПоЗакрывающимДокументам.Итог("Сумма");
	//ВременнаяСтрока = Элементы.ДанныеПоЗакрывающимДокументам.ПодчиненныеЭлементы.ДанныеПоЗакрывающимДокументамСумма
	//Объект.ИтоговаяСуммаПоМероприятию = Объект.ИтоговаяСуммаПоМероприятию - Элементы.ДанныеПоЗакрывающимДокументамСумма.ТекстРедактирования	
//Объект.ИтоговаяСуммаПоМероприятию = Объект.ИтоговаяСуммаПоМероприятию - Объект.ДанныеПоЗакрывающимДокументам[0].Сумма;
КонецПроцедуры




